

  const state = () => ({
    aideList: [
      {
      place: 'random',
      name: 'Компания Зубрила',
      link: 'https://vk.com/kursovye_ekb',
      describe: 'Наши преимущества: Любим своих клиентов, За 10 лет помогли более 300 000 студентам! Рейтинг в 2GIS 4.7 Соответствие требованиям',
      subjects: ["Химия","Физика","Автодор","Электротех","Термех" ,"Детали машин","Машиностроение","Вся экономика","Бух.учет","Логистика","Высшая математика","Математическая статистика","Гидравлика","Сопромат","Метрология","ГМУ","Статистика","Геология","Экология","Философия","Информатика","Социология","История","Инвестиции","Менеджмент","Маркетинг","Проектная деятельность","Мировая экономика","Рынок труда","Основы корпоративного управления"],
      isBlocked: false,
      isConfirmed: true,
      isPaid: true,
      dateOfPayment: '01.04.2022',
      dateOfPaymentEnd: '31.04.2022',
      countOfClicks: 0,
      avatar: 'https://sun9-86.userapi.com/impf/9SOdrn2gPK5iiD6wo6MtXryRSqU95iwGJxvkcw/xf0oc8zDr_g.jpg?size=2160x2160&quality=96&sign=fde3fd3968b417f963fcd97a5a219f4a&type=album'
    },
      {
      place: 'random',
      name: 'Эссе-это просто!',
      link: 'https://vk.com/dz_easy',
      describe: 'Написание качественных эссе, рефератов, курсовых по самым доступным на рынке ценам. Чем больше страниц, тем дешевле цена за один лист',
      //  subjects: ["Химия","Физика","Автодор","Электротех","Термех" ,"Детали машин","Машиностроение","Вся экономика","Бух.учет","Логистика","Высшая математика","Математическая статистика","Гидравлика","Сопромат","Метрология","ГМУ","Статистика","Геология","Экология","Философия","Информатика","Социология","История","Инвестиции","Менеджмент","Маркетинг","Проектная деятельность","Мировая экономика","Рынок труда","Основы корпоративного управления"],
      isBlocked: false,
      isConfirmed: true,
      isPaid: true,
      dateOfPayment: '02.04.2022',
      dateOfPaymentEnd: '31.04.2022',
      countOfClicks: 0,
      avatar: 'https://sun9-83.userapi.com/impf/c850632/v850632226/6a0f3/PH82AnJnXDE.jpg?size=900x900&quality=96&sign=d4637fc7eb3058e871616a319b09cfa8&type=album'
    },
      {
      place: 'random',
      name: 'Виталий Фёдоров',
      link: 'https://vk.com/alfa4i5',
      describe: 'Мы занимаемся консультацией студентов по выполнению контрольных, курсовых и дипломных работ с 2006г. Нашей целью является качественное выполнение оказываемых услуг по минимальной их стоимости. Чтобы наши клиенты всегда оставались довольны и возвращались снова и снова. Мы гарантируем правильность выполнения работ. Доработки устраняем бесплатно! Наша репутация залог качества выполняемых работ. Мы сотрудничаем только со специалистами высокой квалификации.',
      subjects: ['Математика', 'Химия', 'Физика', 'Инженерная графика', 'Начертательная геометрия от руки и на компьютере', 'Детали машин', 'Сопромат', 'Технология машиностроения', 'Теория машин и механизмов', 'Обеспечение грузовых перевозок', 'Управление эксплуатационной работой', 'Организация и управление', 'Экономика', 'Сметное дело в строительстве и путевом хозяйстве', 'Экономика', 'Статистика', 'Право', 'Электроснабжение', 'Метрология', 'ТАУ', 'Организация перевозок', 'Геодезия', 'Ремонт вагонов', 'БЖД'],
      isBlocked: false,
      isConfirmed: true,
      isPaid: true,
      dateOfPayment: '02.04.2022',
      dateOfPaymentEnd: '31.04.2022',
      countOfClicks: 0,
      avatar: 'https://sun9-70.userapi.com/impf/c848636/v848636081/7125b/grUnBld0uGE.jpg?size=960x1280&quality=96&sign=ee67f4d8d48ec0ca3f8cea6934869687&type=album'
    },
      {
      place: 'random',
      name: 'Дмитрий Смирнов',
      link: 'https://vk.com/id567895055',
      describe: 'Мы занимаемся консультацией студентов по выполнению контрольных, курсовых и дипломных работ с 2006г. Нашей целью является качественное выполнение оказываемых услуг по минимальной их стоимости. Чтобы наши клиенты всегда оставались довольны и возвращались снова и снова. Мы гарантируем правильность выполнения работ. Доработки устраняем бесплатно! Наша репутация залог качества выполняемых работ. Мы сотрудничаем только со специалистами высокой квалификации.',
      subjects: ['Математика', 'Химия', 'Физика', 'Инженерная графика', 'Начертательная геометрия от руки и на компьютере', 'Детали машин', 'Сопромат', 'Технология машиностроения', 'Теория машин и механизмов', 'Обеспечение грузовых перевозок', 'Управление эксплуатационной работой', 'Организация и управление', 'Экономика', 'Сметное дело в строительстве и путевом хозяйстве', 'Экономика', 'Статистика', 'Право', 'Электроснабжение', 'Метрология', 'ТАУ', 'Организация перевозок', 'Геодезия', 'Ремонт вагонов', 'БЖД'],
      isBlocked: false,
      isConfirmed: true,
      isPaid: true,
      dateOfPayment: '02.04.2022',
      dateOfPaymentEnd: '31.04.2022',
      countOfClicks: 0,
      avatar: 'https://sun9-9.userapi.com/impg/8atjvbLqliK2cL38GCr7_mzNO7Aos82d8C3R9Q/WCkKeAuCPCs.jpg?size=1110x720&quality=96&sign=ad7b2584c95e37660e9d087b17bc2590&type=album'
    },
      {
      place: 'random',
      name: 'Миля Сабирова',
      link: 'https://vk.com/milya_diplom',
      describe: 'Мы занимаемся консультацией студентов по выполнению контрольных, курсовых и дипломных работ с 2006г. Нашей целью является качественное выполнение оказываемых услуг по минимальной их стоимости. Чтобы наши клиенты всегда оставались довольны и возвращались снова и снова. Мы гарантируем правильность выполнения работ. Доработки устраняем бесплатно! Наша репутация залог качества выполняемых работ. Мы сотрудничаем только со специалистами высокой квалификации.',
      subjects: ['Математика', 'Химия', 'Физика', 'Инженерная графика', 'Начертательная геометрия от руки и на компьютере', 'Детали машин', 'Сопромат', 'Технология машиностроения', 'Теория машин и механизмов', 'Обеспечение грузовых перевозок', 'Управление эксплуатационной работой', 'Организация и управление', 'Экономика', 'Сметное дело в строительстве и путевом хозяйстве', 'Экономика', 'Статистика', 'Право', 'Электроснабжение', 'Метрология', 'ТАУ', 'Организация перевозок', 'Геодезия', 'Ремонт вагонов', 'БЖД'],
      isBlocked: false,
      isConfirmed: true,
      isPaid: true,
      dateOfPayment: '02.04.2022',
      dateOfPaymentEnd: '31.04.2022',
      countOfClicks: 0,
      avatar: 'https://sun9-73.userapi.com/impg/80S2Nkjkx95PyVf7FvlOLobT8E5PKDviLocckA/wZCZ-3nRuVw.jpg?size=2560x1707&quality=96&sign=8b434ce500abf93ce7e2f22ce6512539&type=album'
    },
    ]
  })

  const getters = {
    aideList: (state) => {
      return state.aideList
    }
  }

  export default {
    state, getters
}
